"""
Напишите функцию, которая будет по output команды ls возвращать средний размер файла в папке.
В качестве аргумента функции должен выступать путь до файла с output команды ls
"""
import os


def get_mean_size(ls_output_path: str) -> float:
    """Put your code here"""


if __name__ == "__main__":
    print(get_mean_size("<place ls output file path here>"))
